Котельников_АБ_70153995/src/Documents/ОтказКандидату/ОтказКандидату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтказКандидату</name>
  <registerRecords>InformationRegister.СтатусыКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоКандидатовПоЭтапам</registerRecords>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Котельников_АБ_70153995/src/InformationRegisters/СтатусыКандидатов/СтатусыКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКандидатов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЭтапыПодбора</types>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Котельников_АБ_70153995/src/Enums/ЭтапыПодбора/ЭтапыПодбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПодбора</name>
  <enumValues>
    <name>Неразобранные</name>
  </enumValues>
  <enumValues>
    <name>ПросмотрРезюме</name>
  </enumValues>
  <enumValues>
    <name>ТелефонноеИнтервью</name>
  </enumValues>
  <enumValues>
    <name>ПервичноеСобеседование</name>
  </enumValues>
  <enumValues>
    <name>СобеседованиеСИнициатором</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПринялПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>КандидатОтказалсяОтПредложения</name>
  </enumValues>
  <enumValues>
    <name>ОтказКандидату</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/ОтказКандидату/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда	
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Ответственный = ТекущийПользователь.Сотрудник;
		Объект.АвторДокумента = ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КандидатПриИзменении(Элемент)
	
	Если Объект.Кандидат.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСтатусКандидата(Объект.Кандидат, ПредопределенноеЗначение("Перечисление.ЭтапыПодбора.ОтказКандидату"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.Кандидаты"));
	
КонецПроцедуры

&НаКлиенте
Процедура КандидатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьСообщения();
		
	Если НЕ Объект.Кандидат.Пустая() Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Вы уже выбрали кандидата. Если выбор был ошибочным, то нажмите на кнопку очистки и добавьте другого кандидата", "Объект.Кандидат");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КандидатОчистка(Элемент, СтандартнаяОбработка)
	
	Если Объект.Кандидат.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПоследнийСтатусКандидата = ПолучитьПоследнийСтатусКандидата(Объект.Вакансия, Объект.Кандидат);
	
	ИзменитьСтатусКандидата(Объект.Кандидат, ПоследнийСтатусКандидата);
	ОповеститьОбИзменении(Тип("СправочникСсылка.Кандидаты"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСтатусКандидата(Кандидат, Статус)

	КандидатОбъект = Кандидат.ПолучитьОбъект();
	КандидатОбъект.ЭтапПодбора = Статус;
	КандидатОбъект.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнийСтатусКандидата(Вакансия, Кандидат)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыКандидатовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыКандидатов.СрезПоследних(
		|			,
		|			Вакансия = &Вакансия
		|				И Кандидат = &Кандидат) КАК СтатусыКандидатовСрезПоследних";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("Кандидат", Кандидат);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();

	Возврат Выборка.Статус; 
	
КонецФункции
